Revit 2024 API
StructuralSectionGeneralR Constructor
 Creates a new instance of Structural Section Pipe.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralSectionGeneralR(
	double diameter,
	double wallNominalThickness,
	double wallDesignThickness,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Visual Basic
Public Sub New ( _
	diameter As Double, _
	wallNominalThickness As Double, _
	wallDesignThickness As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	analysisParams As StructuralSectionAnalysisParams _
)
Visual C++
public:
StructuralSectionGeneralR(
	double diameter,
	double wallNominalThickness,
	double wallDesignThickness,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
Parameters
diameter
Type: System.Double
 Pipe Diameter.
wallNominalThickness
Type: System.Double
 Represents wall nominal thickness of rectangle.
wallDesignThickness
Type: System.Double
 Represents wall design thickness of rectangle.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace